[

    {
        "title": "Week 10",
        "subtitle": "FINAL PROJECT: Sprint 1",
        "date": "2020-05-09",
        "paragraphs": [
            "What are your thoughts about the Final Project?",
            "After sprint 1 complete, I'm excited about the final project. I think it solves a real (albeit small) problem in an area I'm passionate about and I feel confident that I'm equipped with the tools to make it happen.",
            "What do you think you will struggle with in completing the Final Project? Where will you excel?",
            "So far my main struggle has been setting up the necessary database. Outside of that, I think design will be a strong point of this project. Part of this is due to the Google Books API I'm using--it's a great resource that provides a lot of quality data.",
            "What are your opinions on the Agile Methodology? Do you think it takes up time? Do you think large scale projects can be completed without it?",
            "I'm sold on Agile development! It's made a huge difference in terms of preparation and providing a structure for work. There's been some bumps--learning how to write stories, point them accurately, implementing story spikes, etc.--but it's definitely worth the time, all the more important as the size of the project grows. "
        ],
        "stack": [
            "Laravel", 
            "MySQL",
            "React"
        ]

    },
  
    
    {
        "title": "Week 9",
        "subtitle": "LARAVEL, MySQL, & REACT",
        "date": "2020-05-03",
        "paragraphs": [
            "What are your thoughts about Laravel and React?",
            "I really like them together. I loved React and am happy to be diving back in, and I'm getting more familiar with Laravel. The two together seem like they can make some powerful things happen!",
            "What is one thing that you love about React or Laravel that you used to hate / didn't understand how to use?",
            "Passing props and state within React components really confused me for a while, but now it's one of my favorite things about it. I still struggle at times, but it makes a lot of sense. I'm particularly excited about getting more comfortable using state/props within reactstrap components as well.",
            "Compared to weeks three and six, what are three ideas you might want to do for your final project? Are they the same, or have they changed now that you understand more about the technology and your limitations?",
            "I'm fairly solid on my final project idea. It's been forming since my experiences in grad school, as well as some of the API and React work we've done. In seminary, I always struggled to stay on top of all the required reading with all the other assignments--I wanted a way to choose a book or books, set a desired end date, and be given a daily reading plan with pages per day in order to hit the goal. I'd like to make this app with a Google Books API to be able to not only keep track of WHICH books you're reading, but be able to set an end date and make sure you read enough each day to get there.",
            "What cool new features have you learned about from the languages and frameworks you already know that will improve your workflow / add slick features to your final project?",
            "I really love bootstrap, and am slowly getting into reactstrap. And this week, getting into Laravel, it seems there's a lot of really cool/helpful built-ins in terms of login/registration packages that will be very useful.",
            "How many jobs have you applied to?",
            "None yet, but I've done a lot of work on LinkedIn, my resume, and have corresponded with a friend who is planning to recommend me for a position where he currently works.",
            "Look back on the old questions to see if any of them would be good to answer this week compared to week 1.",
            ""
        ],
        "stack": [
            "Laravel", 
            "MySQL",
            "React"
        ]

    },

    {
        "title": "Week 8",
        "subtitle": "LARAVEL, PHP, & MySQL",
        "date": "2020-04-26",
        "paragraphs": [
            "What are your thoughts about how far you have come? How has your Digital Literacy, Computational Thinking, and Adoption of Coding Culture increased?",
            "Considering the short amount of time it's been, I think I've come very far. To think back just a few short weeks ago, I couldn't imagine even getting something to display on a screen. Now I have a decent grasp on various languages and frameworks, best practices within the coding world, as well as an increased capacity to think computationally.",
            "How do you plan on continuing to grow those areas?",
            "In the short term, I plan to continue to be diligent in learning for the rest of the bootcamp. Beyond that, I have several books flagged as to-read, as well as new relational avenues within the coding community to continue to get exposure, learn, and stay connected to new people, ideas, and best practices.",
            "What are you struggling with the most in the Tech Stack so far and why?",
            "Laravel has been the biggest challenge so far. I think this is mainly due to the complexity and breadth of it. There's A LOT to take in, become familiar with, and implement.",
            "What were your main takeaways from the career fair?",
            "",
            "After making it through the tech stack, where do you think your current gaps are?",
            "Looking back at the tech stack, I'd say my biggest gap is still pseudo-coding. I feel relatively confident with each language and framework in the stack, however, I'm limited in my use and implementation because I consistently fail to give solid preparation and thought to pseudo-coding."
        ],
        "stack": [
            "Laravel", 
            "PHP", 
            "MySQL"
        ]

    },

    {
        "title": "Week 7",
        "subtitle": "PHP, MySQL, & JAVASCRIPT",
        "date": "2020-04-18",
        "paragraphs": [
            "What have you learned about PHP and server side programming that you were not aware of prior to this week?",
            "PHP is very powerful, but definitely has it's issues. I was surprised at how easily vulnerabilities can be taken advantage of with the program.",
            "What do you want to know more about PHP and server side programming?",
            "I'm very interested in server side programming. I'm not sure exactly what it is I want to know more about--perhaps just the process over all. I'm fascinated by the 'behind-the-scenes' nature of this aspect of programming.",
            "How has learning PHP been? What are some similarities and differences you can see with JS?",
            "Overall, learning PHP hasn't been too difficult. I appreciate the similarities to JS (especially React), but did struggle with the varying syntax and little differences in thinking.",
            "What if you had started with PHP instead of JS?",
            "I think I would have been relieved once I learned JS! So, I'm glad we learned them in the order we did. I think learning PHP was as easy as it was due to my familiarity with JS.",
            "Are there any exercises you think would be improved if you refactored them to PHP from JS? Do you plan to?",
            "",
            "Find one library, framework, NPM package, and/or external web API you think you might want use for your final project.",
            ""
        ],
        "stack": [
            "PHP", 
            "MySQL", 
            "JavaScript"
        ]

    },

    {
        "title": "Week 6",
        "date" : "2020-04-05",
        "subtitle": "REACT, FIREBASE, & JAVASCRIPT",
        "paragraphs" : [ 
           "What do you like about React?",
           "I'm really starting to love how components work. It makes a lot of sense to have JavaScript logic, state, etc. in one component, export that component, and import it elsewhere to build something.",
           "What are you struggling with the most about React?",
           "At this point I think my biggest struggle isn't with React specifically (I feel confident with it), but using JavaScript within it.",
           "How has React caused you to rethink your existing projects?",
           "React definitely allows for things to be much more dynamic and efficient. I've already seen how old projects could be simplified using the component structure.",
           "What is your biggest win this week? Halfway through!",
           "My biggest win was getting the Puzzle Slider completed for Demo Day. I was overwhelmed at first; the project had a lot of factors to consider, but struggling through it (and getting a lot of help) helped me grow in my understanding of confidence level.",
           "Compared to week three, what are three ideas you might want to do for your final project? Are they the same, or have they changed now that you understand more about the technology and your limitations?",
           " "
        ],
        "stack": [
            "React", 
            "Firebase",
            "JavaScript"
        ]
    },

    {
        "title": "Week 5",
        "subtitle": "REACT & FIREBASE",
        "date" : "2020-03-29",
        "paragraphs" : [ 
           "Why are CLIs scary?",
           "I think what scares me most about CLIs is the fact that you don't 'see' a lot of what you're doing. You could run a line  of code from the terminal and it upload/change/delete something from your system and you not know it (if you weren't tracking with what was happening)",
           "What have you learned about CLIs?",
           "I've learned that they can be really efficient. For example, it's much quicker to add, save, push, and edit using a few lines on the command line rather than going to GitHub and editing/merging/etc.",
           "Would you build a CLI? What would it do?",
           "I can't imagine building one, but if I did ..",
           "List a some ideas that without a Framework, would take you a long time to code",
           " ",
           "How do you feel now (week 5) compared to when you started?",
           "At this point in the bootcamp I feel fairly confident. I really like React and Bootstrap and feel like I'm growing a lot and understand what I'm doing. I feel comfortable in the command line, and I enjoy JavaScript but feel less confident there--I can figure out how to make things work, but not always the best way."
        ],
        "stack": [
            "React",
            "Firebase", 
            "JavaScript", 
            "Bootstrap"      
          ]
    },

    {
        "title": "Week 4",
        "subtitle": "NPM & REACT",
        "date" : "2020-03-22",
        "paragraphs" : [ 
           "Why do you see JavaScript Frameworks and Libraries useful or hard to use?",
           " ",
           "What Frameworks or Libraries are you interested in learning more about?",
           " ",
           "Find one emerging JavaScript tool that you would like to learn more about or use in your final project."
        ],
        "stack": [
            "React",
            "JavaScript", 
            "Bootstrap",
            "GitHub"
        ]
    },
    
    {
        "title": "Week 3",
        "subtitle": "JAVASCRIPT & DESIGN",
        "date" : "2020-03-15",
        "paragraphs" : [ 
           "What are three ideas you might want to do for your final project?",
           "I'm having difficulty thinking about potential final project ideas with only being into week 3 of the bootcamp. However, two things I'm personally interested are poetry and literature, as well as personal development in general. It would be interesting to play with an app that could generate custom reading or development 'plans' based on a users given criteria (e.g. 'I have 10 minutes a day', 'I'd like to learn about 'x' topic', 'I'm more of a visual learner', etc.). Then, based on this criteria, generate a plan, with 'due dates' and an end date (set by the user) to work through the generated material.",
           "Why do you see JavaScript useful or hard to use?",
           "JavaScript is incredibly useful! Being able to make function that store multiple 'steps' or calculations of a problem, that is then able to be called throughout the code without repeating the initial steps is a huge time saver, as well as opens up endless possibilities for developing 'smart' programs.",
           "What aspects about JavaScript are you interested in learning more about?",
           "As I wrap my head around arrays more and more, I'm beginning to see their utility and potential. All kinds of things can be stored in and accessed via arrays. This is a really useful tool for user input, storage, and retrieval."
        ],
        "stack": [
            "JavaScript", 
            "Bootstrap",
            "CSS",
            "GitHub"
        ]
    },
    
    {
        "title": "Week 2",
        "subtitle": "JAVASCRIPT & DESIGN",
        "date" : "2020-03-08",
        "paragraphs" : [ 
            "What did you learn about that helped you understand the development process?",
            "Having two Demo Days under our belts, I've seen more each time the importance of understanding and being able to communicate one's code. The development process isn't complete when the code is pushed to GitHub, but really, it's complete when I can understand each line of code and clearly communicate the process to others.",
            "What does it mean to develop good code?",
            "One thing that I'm starting to catch on to is the importance of 'DRY' code ('Don't Repeat Yourself'). The programming languages I'm learning are smart enough to not need repeated lines throughout the code! Learning how to 'reuse' lines of code throughout a project is one important element of good, efficient code.",
            "What does it mean to be a good developer?",
            "Personally, I think being a good developer comes down to two things: excellence and attention. The effort put into development, as well as the code itself, should be excellent. It should be efficient, complete, and without shortcuts. But the project as a whole should always give attention to the specific needs and desires of the customer. Excellent code that isn't useful to the customer isn't excellent!",
            "What is one thing that programmers hate doing?",
            "Repeating themselves! This is why 'DRY' code is such an emphasis in programming; time saving by reusing code throughout a project is a great practice!"
        ],
        "stack": [
            "JavaScript", 
            "Bootstrap",
            "GitHub"
        ]
    },

    {
        "title": "Week 1",
        "subtitle": "JAVASCRIPT, BOOTSTRAP, & DESIGN",
        "date" : "2020-03-01",
        "paragraphs" : [ 
            "What did you learn about that helped you understand more about design?",
            "The design acronym (C.R.A.P.) about contrast, repetition, alignment, and proximity was really helpful. Being married to a graphic designer I often get a lot of help in the way things I create should look, but this overview helped me understand better for myself. I especially resonated with the contrast piece. I tend to think about contrast only in terms of color; using contrast in other ways--fonts, shapes, etc.--was a new way to think about good design.",
            "What do you want to continue learning about that helps you understand design better?",
            "Two things piqued my interest from our lesson on design: 1) the difference between geometric and visual center, and 2) how to guide the eye using design. These two things are incredibly important in good design, as they take into account not only what I think looks good, but how others experience the design.",
            "What Design aspects are important to you as a user and as a developer?",
            "Personally, both alignment and proximity are important to me--both as a user and developer. I find these two things are some of the most noticeable things to the eye. Even if one doesn’t have the vocabulary to explain them, I think most have an intuition for things being misaligned and poorly spaced.",
            "What is the number one thing that held you back this week? Why?",
            "This week was actually fairly straight forward and fun. Bootstrap is great and I spent a lot of time using templates, playing around, extending, and implementing ideas. This approach helped me get familiar with a lot of Bootstraps elements and how they work. However, I think I was “held back” in the sense that I may have benefitted in the long run more had I started from scratch.",
            "What is one thing you would like to get better at in bootcamp?",
            "I think it’s going to be important for me personally to not have perfection as my goal, but rather progress. I prefer things neat, clean, and finished. But I also value learning and know that the learning process is seldom neat or clean, and never finished."
        ],
        "stack": [
            "Bootstrap", 
            "CSS", 
            "JavaScript"
        ]
    },

    {
        "title": "Prework Week 4",
        "subtitle": "JAVASCRIPT",
        "date" : "2020-02-23",
        "paragraphs" : [ 
            "What are yourWhat was one thing you liked and disliked about each of the new topics covered in prework?",
            "While I liked all the topics covered in prework, there were unique things about each that I found difficult. GitHub was easy to begin working with, but communicating between GitHub and the terminal was challenging. HTML and CSS as a pair were fairly straightforward in how they relate to one another, but I struggled particularly with padding and margin within CSS. JavaScript has been both the most likeable and most difficult topic; I've love the logical thinking required and how all the pieces fit together, however, there are a lot of pieces and learning them all has been overwhelming.",
            "What was helpful?",
            "A few things helped me during the prework. The first was the #help channel in Slack. I asked a lot of questions and learned a lot from the instructors, as well as the other students. The other help was learning about pseudo-coding. I can see how this will be invaluable when approaching bigger, more complicated projects--especially involving JavaScript.",
            "What hindered your progress?",
            "I didn't feel too hindered throughout prework, however, I think I could have jumped into the projects and assignments sooner than I did each week. I spent a good bit of time reading documentation and trying to understand thoroughly before getting my hands dirty. I think I would have been helped more by getting into the code myself instead of reading so much.",
            "How did you overcome challenges?",
            "The challenges during prework were overcome by plodding. By that I mean simply coming back to the problems each day, giving them time and effort, and doing the work necessary to move forward. I don't think there's going to be any magic bullets with web development but rather--like anything else--it's going to come down to showing up each day and taking a few steps forward."
        ],
        "stack": [
            "JavaScript", 
            "CSS", 
            "Bootstrap",
            "GitHub"
        ]
    },

    {
        "title": "Prework Week 3",
        "subtitle": "HTML, CSS, & JAVASCRIPT",
        "date" : "2020-02-16",
        "paragraphs" : [ 
            "What are your thoughts about the roles HTML, CSS, and JavaScript play in the process of rendering content and providing user experience?",
            "I really like how HTML, CSS, and JavaScript work together. It makes conceptual sense to me, and the little bit I’ve grasped thus far has enabled me to do some pretty cool things with my blog (the dropdown navbar and footer icons in particular). I’m a little concerned about my ability to keep all the sheets “clean”--creating various classes to make all the features move how I want seems to get out of hand at times--but I’m sure that will come with time!", 
            "What are some objects that your blog incorporates?",
            "In terms of the three tools’ ability to provide user experience, I’m excited to keep learning. JavaScript in particular seems to be a really powerful tool with endless possibilities for functionality and user experience. So far, my blog incorporates various objects to improve user experience. The main object being the navigation bar. It’s HTML and CSS code enable it to change color on click and hover, as well as incorporate dropdown sections under “Projects” and “Blog”. Also, the blog features a footer which contains two icons linked to my personal LinkedIn profile and Twitter page. In the future, I hope to implement JavaScript to loop through text on the home page (“Learning HTML”, “Learning CSS”, “Learning JavaScript”, etc.)."
        ],
        "stack": [
            "HTML", 
            "CSS", 
            "Bootstrap",
            "GitHub"
        ]
    },

    {
        "title": "Prework Week 2",
        "subtitle": "HTML, CSS, & PSEUDO-CODE",
        "date" : "2020-02-09",
        "paragraphs" : [ 
            "What are your thoughts on pseudo coding?",
            "Pseudo code is very helpful. Its use of fuller language reminds me of formulas in spreadsheets--where I’ve had most of my experience. The language itself seems very logical which is helpful for me. The high-level, descriptive nature of pseudo code is helpful for me as I come at programming as a beginner; having a tool like this to layout big-picture components with easy to understand comments will be a huge help!", 
            "What are you struggling with?",
            "It’s less of a specific struggle and more like walking around in the dark--I spent a good bit of time looking at code for certain features, manipulating it, seeing what changed and what didn’t, and trying to understand everything. This poking around feels a little like a “struggle” but it’s also leading to some helpful discoveries and, I hope, a better working grasp on the overall process.",
            "What are you excited or eager to learn more about?",
            "After playing around with this blog for a day or so, experimenting with fixed navigation bars, margin, gradient colors, etc., I’m eager to become more familiar with the capabilities of CSS. Specifically, I’m excited to learn more about the box model and how it can be used to incorporate features like drop down navigation bars and aside content. Wading into CSS this past week has increased my interest in and awareness of all the websites I frequent--I’m gaining a better eye for good design and usability!"
        ],
        "stack": [
            "HTML", 
            "CSS", 
            "GitHub"
        ]
    },

    {
        "title": "Prework Week 1",
        "subtitle": "GIT & GITHUB",
        "date" : "2020-02-02",
        "paragraphs" : [ 
            "Was your first week what you expected? Why? Why not?",
            "Week one flew by--but was not without moments that felt painfully long (fumbling through Git, navigating the Command Line, etc.). I expected to struggle, and to feel a little overwhelmed, but wasn't sure how I would struggle. That's where I've been living: swimming in questions I didn't know I needed to ask!", 
            "What are you struggling with?",
            "In some sense I feel like everything's a struggle (re: swimming in questions!). But specifically, I'm still tiptoeing my way around GitHub, poking around in the Command Line, and crossing my fingers that repo's magically appear!",
            "What are you excited or eager to learn more about?",
            "With the Command Line feeling a little more like home each day, I'm excited to continue uncovering its power. Beyond the CL, I'm eager to jump into html--the little bit I've picked up thus far has me itching to dive in deeper! (Specifically, how to make this text not run the length of the page!)"
        ],
        "stack": [
            "Git",
            "GitHub"        ]
    }


]